[Survived] ConditionalExpression
src/components/layout/Layout.tsx:59:18
             <footer>
               <span>
                 Copyright © 2006
-                {new Date().getFullYear() > 2006
+                {false
                   ? "-" + new Date().getFullYear()
                   : ""}{" "}

[Survived] EqualityOperator
src/components/layout/Layout.tsx:59:43
             <footer>
               <span>
                 Copyright © 2006
-                {new Date().getFullYear() > 2006
+                {new Date().getFullYear() >= 2006
                   ? "-" + new Date().getFullYear()
                   : ""}{" "}

[Survived] ArithmeticOperator
src/components/layout/Layout.tsx:60:25
               <span>
                 Copyright © 2006
                 {new Date().getFullYear() > 2006
-                  ? "-" + new Date().getFullYear()
+                  ? "-" - new Date().getFullYear()
                   : ""}{" "}
                 Troop 485, Silicon Valley Monterey Bay Council, Boy Scouts of

[Survived] StringLiteral
src/components/layout/Layout.tsx:61:21
                 Copyright © 2006
                 {new Date().getFullYear() > 2006
                   ? "-" + new Date().getFullYear()
-                  : ""}{" "}
+                  : "Stryker was here!"}{" "}
                 Troop 485, Silicon Valley Monterey Bay Council, Boy Scouts of
                 America.

[Survived] StringLiteral
src/components/layout/Layout.tsx:61:25
                 Copyright © 2006
                 {new Date().getFullYear() > 2006
                   ? "-" + new Date().getFullYear()
-                  : ""}{" "}
+                  : ""}{""}
                 Troop 485, Silicon Valley Monterey Bay Council, Boy Scouts of
                 America.

[Survived] ConditionalExpression
src/components/layout/Layout.tsx:72:7
     </>
   )
 
-  if (!backgroundImage) {
+  if (false) {
     return page
   } else {

[Survived] BlockStatement
src/components/layout/Layout.tsx:72:25
     </>
   )
 
-  if (!backgroundImage) {
-    return page
-  } else {
+  if (!backgroundImage) {} else {
     return (
       <BackgroundImage

[Survived] BlockStatement
src/components/layout/Layout.tsx:74:10
 
   if (!backgroundImage) {
     return page
-  } else {
-    return (
-      <BackgroundImage
-        Tag="section"
-        className={"bg-full"}
-        fluid={[backgroundImage]}
-      >
-        {page}
-      </BackgroundImage>
-    )
-  }
+  } else {}
 }
 // export { Layout };
