[Survived] BlockStatement
src/components/layout/Navbar.tsx:9:18
 function NavbarLink(props: {
   page: string
   children: ReactNode
-}): ReactElement {
-  // Gatsby link element doesn't work well with our storybook config
-  return (
-    <>
-      {/*<Link to={"/" + props.page} className="link-no-style">*/}
-      <Nav.Link
-        eventKey={props.page}
-        onClick={(): void => {
-          navigate("/" + props.page)
-        }}
-      >
-        {props.children}
-      </Nav.Link>
-      {/*</Link>*/}
-    </>
-  )
-}
+}): ReactElement {}
 
 interface PropDef {

[Survived] BlockStatement
src/components/layout/Navbar.tsx:16:30
       {/*<Link to={"/" + props.page} className="link-no-style">*/}
       <Nav.Link
         eventKey={props.page}
-        onClick={(): void => {
-          navigate("/" + props.page)
-        }}
+        onClick={(): void => {}}
       >
         {props.children}

[Survived] ArithmeticOperator
src/components/layout/Navbar.tsx:17:24
       <Nav.Link
         eventKey={props.page}
         onClick={(): void => {
-          navigate("/" + props.page)
+          navigate("/" - props.page)
         }}
       >

[Survived] StringLiteral
src/components/layout/Navbar.tsx:46:27
         {/* <Container> */}
         <Link to="/" className="link-no-style">
           <BootstrapNavbar.Brand as="span">
-            BSA Troop 485{" "}
+            BSA Troop 485{""}
             {admin ? <span style={{ color: "#99ccff" }}>| Admin</span> : <></>}
           </BootstrapNavbar.Brand>

[Survived] ObjectLiteral
src/components/layout/Navbar.tsx:47:35
         <Link to="/" className="link-no-style">
           <BootstrapNavbar.Brand as="span">
             BSA Troop 485{" "}
-            {admin ? <span style={{ color: "#99ccff" }}>| Admin</span> : <></>}
+            {admin ? <span style={{}}>| Admin</span> : <></>}
           </BootstrapNavbar.Brand>
         </Link>
