[Survived] ConditionalExpression
src/components/layout/seo.tsx:25:10
   keywords?: string[]
   title: string
 }): ReactElement {
-  lang = lang || "en"
+  lang = false
   description = description || ""
   meta = meta || []

[Survived] LogicalOperator
src/components/layout/seo.tsx:25:15
   keywords?: string[]
   title: string
 }): ReactElement {
-  lang = lang || "en"
+  lang = lang && "en"
   description = description || ""
   meta = meta || []

[Survived] ConditionalExpression
src/components/layout/seo.tsx:26:17
   title: string
 }): ReactElement {
   lang = lang || "en"
-  description = description || ""
+  description = false
   meta = meta || []
   keywords = keywords || []

[Survived] ConditionalExpression
src/components/layout/seo.tsx:26:17
   title: string
 }): ReactElement {
   lang = lang || "en"
-  description = description || ""
+  description = true
   meta = meta || []
   keywords = keywords || []

[Survived] LogicalOperator
src/components/layout/seo.tsx:27:15
 }): ReactElement {
   lang = lang || "en"
   description = description || ""
-  meta = meta || []
+  meta = meta && []
   keywords = keywords || []
 

[Survived] ConditionalExpression
src/components/layout/seo.tsx:27:10
 }): ReactElement {
   lang = lang || "en"
   description = description || ""
-  meta = meta || []
+  meta = true
   keywords = keywords || []
 

[Survived] ConditionalExpression
src/components/layout/seo.tsx:28:14
   lang = lang || "en"
   description = description || ""
   meta = meta || []
-  keywords = keywords || []
+  keywords = false
 
   const { site } = useStaticQuery(

[Survived] ConditionalExpression
src/components/layout/seo.tsx:28:14
   lang = lang || "en"
   description = description || ""
   meta = meta || []
-  keywords = keywords || []
+  keywords = true
 
   const { site } = useStaticQuery(

[Survived] StringLiteral
src/components/layout/seo.tsx:31:12
   keywords = keywords || []
 
   const { site } = useStaticQuery(
-    graphql`
-      query {
-        site {
-          siteMetadata {
-            title
-            description
-            author
-          }
-        }
-      }
-    `
+    graphql""
   )
 

[Survived] ConditionalExpression
src/components/layout/seo.tsx:44:27
     `
   )
 
-  const metaDescription = description || site.siteMetadata.description
+  const metaDescription = false
 
   return (

[Survived] ConditionalExpression
src/components/layout/seo.tsx:44:27
     `
   )
 
-  const metaDescription = description || site.siteMetadata.description
+  const metaDescription = true
 
   return (

[Survived] ObjectLiteral
src/components/layout/seo.tsx:58:9
           name: `description`,
           content: metaDescription,
         },
-        {
-          property: `og:title`,
-          content: title,
-        },
+        {},
         {
           property: `og:description`,

[Survived] StringLiteral
src/components/layout/seo.tsx:59:21
           content: metaDescription,
         },
         {
-          property: `og:title`,
+          property: "",
           content: title,
         },

[Survived] ObjectLiteral
src/components/layout/seo.tsx:62:9
           property: `og:title`,
           content: title,
         },
-        {
-          property: `og:description`,
-          content: metaDescription,
-        },
+        {},
         {
           property: `og:type`,

[Survived] StringLiteral
src/components/layout/seo.tsx:63:21
           content: title,
         },
         {
-          property: `og:description`,
+          property: "",
           content: metaDescription,
         },

[Survived] StringLiteral
src/components/layout/seo.tsx:67:21
           content: metaDescription,
         },
         {
-          property: `og:type`,
+          property: "",
           content: `website`,
         },

[Survived] ObjectLiteral
src/components/layout/seo.tsx:70:9
           property: `og:type`,
           content: `website`,
         },
-        {
-          name: `twitter:card`,
-          content: `summary`,
-        },
+        {},
         {
           name: `twitter:creator`,

[Survived] ObjectLiteral
src/components/layout/seo.tsx:74:9
           name: `twitter:card`,
           content: `summary`,
         },
-        {
-          name: `twitter:creator`,
-          content: site.siteMetadata.author,
-        },
+        {},
         {
           name: `twitter:title`,

[Survived] ObjectLiteral
src/components/layout/seo.tsx:78:9
           name: `twitter:creator`,
           content: site.siteMetadata.author,
         },
-        {
-          name: `twitter:title`,
-          content: title,
-        },
+        {},
         {
           name: `twitter:description`,

[Survived] StringLiteral
src/components/layout/seo.tsx:79:17
           content: site.siteMetadata.author,
         },
         {
-          name: `twitter:title`,
+          name: "",
           content: title,
         },

[Survived] StringLiteral
src/components/layout/seo.tsx:83:17
           content: title,
         },
         {
-          name: `twitter:description`,
+          name: "",
           content: metaDescription,
         },

[Survived] ConditionalExpression
src/components/layout/seo.tsx:88:11
         },
       ]
         .concat(
-          keywords.length > 0
+          false
             ? {
                 name: `keywords`,

[Survived] EqualityOperator
src/components/layout/seo.tsx:88:27
         },
       ]
         .concat(
-          keywords.length > 0
+          keywords.length <= 0
             ? {
                 name: `keywords`,

[Survived] StringLiteral
src/components/layout/seo.tsx:90:23
         .concat(
           keywords.length > 0
             ? {
-                name: `keywords`,
+                name: "",
                 content: keywords.join(`, `),
               }

[Survived] ArrayDeclaration
src/components/layout/seo.tsx:93:15
                 name: `keywords`,
                 content: keywords.join(`, `),
               }
-            : []
+            : ["Stryker was here"]
         )
         .concat(meta)}
