[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:58:8
 }: VotingGroupProps): ReactElement => {
   return (
     <div>
-      {title && <h4 className="mb-1 votingGroupTitle">{title}</h4>}
+      {false}
       {description && <p className="text-muted mb-2 mt-1 votingGroupDescription">
         {description}

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:58:8
 }: VotingGroupProps): ReactElement => {
   return (
     <div>
-      {title && <h4 className="mb-1 votingGroupTitle">{title}</h4>}
+      {true}
       {description && <p className="text-muted mb-2 mt-1 votingGroupDescription">
         {description}

[Killed] LogicalOperator
src/components/voting/VotingGroup.tsx:59:20
   return (
     <div>
       {title && <h4 className="mb-1 votingGroupTitle">{title}</h4>}
-      {description && <p className="text-muted mb-2 mt-1 votingGroupDescription">
+      {description || <p className="text-muted mb-2 mt-1 votingGroupDescription">
         {description}
       </p>}

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:59:8
   return (
     <div>
       {title && <h4 className="mb-1 votingGroupTitle">{title}</h4>}
-      {description && <p className="text-muted mb-2 mt-1 votingGroupDescription">
-        {description}
-      </p>}
+      {false}
       {maxVotes && <p className={classNames("mt-2 mb-1 votingGroupMaxVotes", (value||[]).length > maxVotes ? "text-danger" : "text-muted")}>
         {(value||[]).length} of {maxVotes} votes used. You are not required to use all your votes.

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:62:8
       {description && <p className="text-muted mb-2 mt-1 votingGroupDescription">
         {description}
       </p>}
-      {maxVotes && <p className={classNames("mt-2 mb-1 votingGroupMaxVotes", (value||[]).length > maxVotes ? "text-danger" : "text-muted")}>
-        {(value||[]).length} of {maxVotes} votes used. You are not required to use all your votes.
-      </p>}
+      {true}
       {options.map((opt, i) => {
         const checked = value?.indexOf(opt.value) > -1

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:62:78
       {description && <p className="text-muted mb-2 mt-1 votingGroupDescription">
         {description}
       </p>}
-      {maxVotes && <p className={classNames("mt-2 mb-1 votingGroupMaxVotes", (value||[]).length > maxVotes ? "text-danger" : "text-muted")}>
+      {maxVotes && <p className={classNames("mt-2 mb-1 votingGroupMaxVotes", true ? "text-danger" : "text-muted")}>
         {(value||[]).length} of {maxVotes} votes used. You are not required to use all your votes.
       </p>}

[Killed] LogicalOperator
src/components/voting/VotingGroup.tsx:63:16
         {description}
       </p>}
       {maxVotes && <p className={classNames("mt-2 mb-1 votingGroupMaxVotes", (value||[]).length > maxVotes ? "text-danger" : "text-muted")}>
-        {(value||[]).length} of {maxVotes} votes used. You are not required to use all your votes.
+        {(value&&[]).length} of {maxVotes} votes used. You are not required to use all your votes.
       </p>}
       {options.map((opt, i) => {

[Killed] BlockStatement
src/components/voting/VotingGroup.tsx:65:32
       {maxVotes && <p className={classNames("mt-2 mb-1 votingGroupMaxVotes", (value||[]).length > maxVotes ? "text-danger" : "text-muted")}>
         {(value||[]).length} of {maxVotes} votes used. You are not required to use all your votes.
       </p>}
-      {options.map((opt, i) => {
-        const checked = value?.indexOf(opt.value) > -1
-        return (
-          <Form.Check
-            key={i}
-            custom
-            id={`check-${i}-${typeof opt.value}-${opt.value}`} // required for react bootstrap
-            label={opt.label}
-            checked={checked}
-            onChange={(): void => onSelectChange(opt.value, !checked)}
-          />
-        )
-      })}
+      {options.map((opt, i) => {})}
     </div>
   )

[Killed] ConditionalExpression
src/components/voting/VotingGroup.tsx:66:25
         {(value||[]).length} of {maxVotes} votes used. You are not required to use all your votes.
       </p>}
       {options.map((opt, i) => {
-        const checked = value?.indexOf(opt.value) > -1
+        const checked = true
         return (
           <Form.Check

[Killed] EqualityOperator
src/components/voting/VotingGroup.tsx:66:51
         {(value||[]).length} of {maxVotes} votes used. You are not required to use all your votes.
       </p>}
       {options.map((opt, i) => {
-        const checked = value?.indexOf(opt.value) > -1
+        const checked = value?.indexOf(opt.value) <= -1
         return (
           <Form.Check

[Killed] BooleanLiteral
src/components/voting/VotingGroup.tsx:74:61
             id={`check-${i}-${typeof opt.value}-${opt.value}`} // required for react bootstrap
             label={opt.label}
             checked={checked}
-            onChange={(): void => onSelectChange(opt.value, !checked)}
+            onChange={(): void => onSelectChange(opt.value, checked)}
           />
         )

[Killed] ArrowFunction
src/components/voting/VotingGroup.tsx:74:23
             id={`check-${i}-${typeof opt.value}-${opt.value}`} // required for react bootstrap
             label={opt.label}
             checked={checked}
-            onChange={(): void => onSelectChange(opt.value, !checked)}
+            onChange={() => undefined}
           />
         )
