[Survived] StringLiteral
t485/src/pages/index.tsx:10:19
 
 const IndexPage = (): ReactElement => (
   <StaticQuery
-    query={graphql`
-      query {
-        desktop: file(
-          relativePath: { eq: "bg_cropped_progressive_darken25.jpg" }
-        ) {
-          childImageSharp {
-            fluid(quality: 100, maxWidth: 1920) {
-              ...GatsbyImageSharpFluid
-            }
-          }
-        }
-      }
-    `}
+    query={graphql""}
     render={(data): ReactElement => (
       <Layout

[Survived] ArrowFunction
t485/src/pages/index.tsx:23:13
         }
       }
     `}
-    render={(data): ReactElement => (
-      <Layout
-        pageName="index"
-        backgroundImage={data.desktop.childImageSharp.fluid}
-      >
-        <SEO
-          title="Home"
-          keywords={[`Troop 485`, `Scouting`, `Boy Scouts`, `Cupertino`]}
-        />
-        <Container className="text-center container">
-          <header className="major">
-            <h1>Troop 485</h1>
-            <p>Cupertino, California</p>
-            <div>
-              <Button variant="outline-light" size="lg" className="cta">
-                About Us
-              </Button>
-              <Button variant="primary" size="lg" className="cta">
-                Join Today
-              </Button>
-            </div>
-          </header>
-        </Container>
-      </Layout>
-    )}
+    render={() => undefined}
   />
 )

[Survived] StringLiteral
t485/src/pages/index.tsx:30:47
       >
         <SEO
           title="Home"
-          keywords={[`Troop 485`, `Scouting`, `Boy Scouts`, `Cupertino`]}
+          keywords={[`Troop 485`, `Scouting`, "", `Cupertino`]}
         />
         <Container className="text-center container">

[Survived] StringLiteral
t485/src/pages/index.tsx:30:22
       >
         <SEO
           title="Home"
-          keywords={[`Troop 485`, `Scouting`, `Boy Scouts`, `Cupertino`]}
+          keywords={["", `Scouting`, `Boy Scouts`, `Cupertino`]}
         />
         <Container className="text-center container">
