[Survived] BlockStatement
code/t485/src/setupTests.ts:8:49
 const jsdom = new JSDOM("<!doctype html><html><body></body></html>")
 const { window } = jsdom
 
-function copyProps(src: any, target: any): void {
-  Object.defineProperties(target, {
-    ...Object.getOwnPropertyDescriptors(src),
-    ...Object.getOwnPropertyDescriptors(target),
-  })
-}
+function copyProps(src: any, target: any): void {}
 
 ;(global as any).window = window

[Survived] StringLiteral
code/t485/src/setupTests.ts:18:14
 ;(global as any).window = window
 ;(global as any).document = window.document
 ;(global as any).navigator = {
-  userAgent: "node.js",
+  userAgent: "",
 }
 ;(global as any).requestAnimationFrame = function(callback: any): any {

[Survived] BlockStatement
code/t485/src/setupTests.ts:20:71
 ;(global as any).navigator = {
   userAgent: "node.js",
 }
-;(global as any).requestAnimationFrame = function(callback: any): any {
-  return setTimeout(callback, 0)
-}
+;(global as any).requestAnimationFrame = function(callback: any): any {}
 ;(global as any).cancelAnimationFrame = function(id: number): void {
   clearTimeout(id)

[Survived] BlockStatement
code/t485/src/setupTests.ts:23:68
 ;(global as any).requestAnimationFrame = function(callback: any): any {
   return setTimeout(callback, 0)
 }
-;(global as any).cancelAnimationFrame = function(id: number): void {
-  clearTimeout(id)
-}
+;(global as any).cancelAnimationFrame = function(id: number): void {}
 copyProps(window, global)
 configure({ adapter: new React16Adapter() })
